const badges = [
  "伸びしろのある新人",
  "一人前のプロフェッショナル",
  "達人級のエキスパート",
  "営業のスペシャリスト",
  "技術に精通したエンジニア",
  "チームワークを重視するリーダー",
  "マネジメント能力に優れたリーダー",
  "新規事業開発の専門家",
  "プロジェクトマネージャー",
  "マーケティング戦略の専門家",
  "イノベーションリーダー",
  "ビジネスディレクター",
  "データ分析のエキスパート",
  "クリエイティブディレクター",
  "デザイン思考のプロフェッショナル",
  "サプライチェーンマネージャー",
  "財務アナリスト",
  "顧客満足度向上の専門家",
  "グローバルビジネス開発者",
  "人材育成に長けたリーダー",
];

const colors = [
  "#FF6347",
  "#CCCC00",
  "#00FF00",
  "#1E90FF",
  "#8A2BE2",
  "#9932CC",
  "#FF0000",
  "#FFFF00",
  "#008000",
  "#0000FF",
  "#FF69B4",
  "#DC143C",
  "#FFA500",
  "#9ACD32",
  "#00BFFF",
  "#BA55D3",
  "#4169E1",
  "#FFD700",
  "#1E90FF",
  "#FFC0CB",
];

export const BadgeToColor = {};
badges.forEach((badge, index) => {
  BadgeToColor[badge] = colors[index];
});

export const Badges = badges.map((name, index) => ({
  name: name,
  color: colors[index],
}));
